#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
#### Environment 🌍 `dev`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Tech_Devops/2-Tier-Project-Terrafrom/runs/run-MPusHHBVX6r7Knxd

Waiting for the plan to start...

Terraform v1.14.6
on linux_amd64
Initializing plugins and modules...
aws_vpc.main: Refreshing state... [id=vpc-02af4fc840205c9d0]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0891f84ab823c4c32]
aws_route_table.public: Refreshing state... [id=rtb-07199dbc2b33f3d2d]
aws_route_table.private[0]: Refreshing state... [id=rtb-0e08b70ff89588dee]
aws_subnet.public[1]: Refreshing state... [id=subnet-0d9b7e87dac288e79]
aws_subnet.public[0]: Refreshing state... [id=subnet-0dc800a425b9a0937]
aws_internet_gateway.main: Refreshing state... [id=igw-04b3e897875405ab2]
aws_subnet.private[0]: Refreshing state... [id=subnet-0278720e0b51721a2]
aws_lb_target_group.app_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:352953744040:targetgroup/app-target-group-production/1e785042cf4d6888]
aws_subnet.private[1]: Refreshing state... [id=subnet-04ebb91aa3b959bd6]
aws_security_group.alb_sg: Refreshing state... [id=sg-00744813e72d3b312]
aws_route_table.private[1]: Refreshing state... [id=rtb-07a1a50b44a5f3e74]
aws_route.public: Refreshing state... [id=r-rtb-07199dbc2b33f3d2d1080289494]
aws_eip.main[0]: Refreshing state... [id=eipalloc-0e6019904238ac9dc]
aws_eip.main[1]: Refreshing state... [id=eipalloc-08d9616b1a683fc4d]
aws_security_group.app_sg: Refreshing state... [id=sg-0ca2e5e0be1dcd8f5]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0023aadb0c25ee615]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01883cd93f9b4dd76]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-080d5766fc57d86dd]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-047888800c91355aa]
aws_lb.app_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:352953744040:loadbalancer/app/app-load-balancer-production/f820bceac352ef94]
aws_launch_template.app: Refreshing state... [id=lt-021015f096ffea2d2]
aws_lb_listener.http_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:352953744040:listener/app/app-load-balancer-production/f820bceac352ef94/9bb3836d52504d86]
aws_autoscaling_group.app_asg: Refreshing state... [id=app-asg-production]
aws_nat_gateway.main[1]: Refreshing state... [id=nat-0341e033a2e16e037]
aws_nat_gateway.main[0]: Refreshing state... [id=nat-01b6f56806e79145d]
aws_route.private[1]: Refreshing state... [id=r-rtb-07a1a50b44a5f3e741080289494]
aws_route.private[0]: Refreshing state... [id=r-rtb-0e08b70ff89588dee1080289494]
aws_autoscaling_policy.scale_in: Refreshing state... [id=scale-in-production]
aws_autoscaling_policy.target_tracking: Refreshing state... [id=target-tracking-policy-production]
aws_autoscaling_policy.scale_out: Refreshing state... [id=scale-out-production]
aws_cloudwatch_metric_alarm.low_cpu: Refreshing state... [id=low-cpu-utilization-production]
aws_cloudwatch_metric_alarm.high_cpu: Refreshing state... [id=high-cpu-utilization-production]
aws_lb.app_lb: Drift detected (update)
aws_internet_gateway.main: Drift detected (update)
aws_security_group.allow_ssh: Drift detected (update)
aws_cloudwatch_metric_alarm.low_cpu: Drift detected (update)
aws_eip.main[1]: Drift detected (update)
aws_eip.main[0]: Drift detected (update)
aws_autoscaling_group.app_asg: Drift detected (update)
aws_vpc.main: Drift detected (update)
aws_route_table.public: Drift detected (update)
aws_nat_gateway.main[0]: Drift detected (update)
aws_nat_gateway.main[1]: Drift detected (update)
aws_subnet.public[1]: Drift detected (update)
aws_subnet.public[0]: Drift detected (update)
aws_security_group.alb_sg: Drift detected (update)
aws_route_table.private[0]: Drift detected (update)
aws_route_table.private[1]: Drift detected (update)
aws_security_group.app_sg: Drift detected (update)
aws_cloudwatch_metric_alarm.high_cpu: Drift detected (update)
aws_lb_listener.http_listener: Drift detected (update)
aws_subnet.private[1]: Drift detected (update)
aws_subnet.private[0]: Drift detected (update)
aws_launch_template.app: Drift detected (update)
aws_lb_target_group.app_tg: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-MPusHHBVX6r7Knxd/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-MPusHHBVX6r7Knxd/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.app_asg must be replaced
-/+ resource "aws_autoscaling_group" "app_asg" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:352953744040:autoScalingGroup:7d0ae43c-78b8-40e1-98ac-c5ce9e171464:autoScalingGroupName/app-asg-production" -> (known after apply)
      ~ availability_zones               = [
          - "us-east-1a",
          - "us-east-1b",
        ] -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      ~ desired_capacity                 = 2 -> 4
      - enabled_metrics                  = [] -> null
      ~ id                               = "app-asg-production" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
      - max_instance_lifetime            = 0 -> null
      ~ max_size                         = 10 -> 2
      ~ min_size                         = 2 -> 1
      ~ name                             = "app-asg-production" -> "app-asg-dev" # forces replacement
      + name_prefix                      = (known after apply)
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::352953744040:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [
          - "arn:aws:elasticloadbalancing:us-east-1:352953744040:targetgroup/app-target-group-production/1e785042cf4d6888",
        ] -> (known after apply)
      - termination_policies             = [] -> null
      ~ vpc_zone_identifier              = [
          - "subnet-0278720e0b51721a2",
          - "subnet-04ebb91aa3b959bd6",
        ] -> (known after apply)
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (12 unchanged attributes hidden)

      ~ availability_zone_distribution (known after apply)
      - availability_zone_distribution {
          - capacity_distribution_strategy = "balanced-best-effort" -> null
        }

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "default" -> null
        }

      ~ launch_template {
            id      = "lt-021015f096ffea2d2"
          ~ name    = "app-launch-template-20260306070640210200000004" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ mixed_instances_policy (known after apply)

      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "app-instance-production" -> null
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "app-instance-dev"
        }

      ~ traffic_source (known after apply)
      - traffic_source {
          - identifier = "arn:aws:elasticloadbalancing:us-east-1:352953744040:targetgroup/app-target-group-production/1e785042cf4d6888" -> null
          - type       = "elbv2" -> null
        }
    }

  # aws_autoscaling_policy.scale_in must be replaced
-/+ resource "aws_autoscaling_policy" "scale_in" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:352953744040:scalingPolicy:522fc638-254a-40f9-b572-03bd9fdbd8c2:autoScalingGroupName/app-asg-production:policyName/scale-in-production" -> (known after apply)
      ~ autoscaling_group_name    = "app-asg-production" -> "app-asg-dev" # forces replacement
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "scale-in-production" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
      - min_adjustment_magnitude  = 0 -> null
      ~ name                      = "scale-in-production" -> "scale-in-dev" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_autoscaling_policy.scale_out must be replaced
-/+ resource "aws_autoscaling_policy" "scale_out" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:352953744040:scalingPolicy:9850fab6-53d0-475a-bc92-4bb29756f6ff:autoScalingGroupName/app-asg-production:policyName/scale-out-production" -> (known after apply)
      ~ autoscaling_group_name    = "app-asg-production" -> "app-asg-dev" # forces replacement
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "scale-out-production" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
      - min_adjustment_magnitude  = 0 -> null
      ~ name                      = "scale-out-production" -> "scale-out-dev" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_autoscaling_policy.target_tracking must be replaced
-/+ resource "aws_autoscaling_policy" "target_tracking" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:352953744040:scalingPolicy:1edc893e-3ab4-46cb-bef2-a05ce524bab8:autoScalingGroupName/app-asg-production:policyName/target-tracking-policy-production" -> (known after apply)
      ~ autoscaling_group_name    = "app-asg-production" -> "app-asg-dev" # forces replacement
      - cooldown                  = 0 -> null
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "target-tracking-policy-production" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
      - min_adjustment_magnitude  = 0 -> null
      ~ name                      = "target-tracking-policy-production" -> "target-tracking-policy-dev" # forces replacement
      - scaling_adjustment        = 0 -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.high_cpu must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "high_cpu" {
      ~ alarm_actions                         = [
          - "arn:aws:autoscaling:us-east-1:352953744040:scalingPolicy:9850fab6-53d0-475a-bc92-4bb29756f6ff:autoScalingGroupName/app-asg-production:policyName/scale-out-production",
        ] -> (known after apply)
      ~ alarm_name                            = "high-cpu-utilization-production" -> "high-cpu-utilization-dev" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:us-east-1:352953744040:alarm:high-cpu-utilization-production" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
          ~ "AutoScalingGroupName" = "app-asg-production" -> "app-asg-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "high-cpu-utilization-production" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {
          - "Environment" = "production"
        } -> null
      ~ tags_all                              = {
          ~ "Environment" = "production" -> "dev"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.low_cpu must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "low_cpu" {
      ~ alarm_actions                         = [
          - "arn:aws:autoscaling:us-east-1:352953744040:scalingPolicy:522fc638-254a-40f9-b572-03bd9fdbd8c2:autoScalingGroupName/app-asg-production:policyName/scale-in-production",
        ] -> (known after apply)
      ~ alarm_name                            = "low-cpu-utilization-production" -> "low-cpu-utilization-dev" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:us-east-1:352953744040:alarm:low-cpu-utilization-production" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
          ~ "AutoScalingGroupName" = "app-asg-production" -> "app-asg-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "low-cpu-utilization-production" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {
          - "Environment" = "production"
        } -> null
      ~ tags_all                              = {
          ~ "Environment" = "production" -> "dev"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

  # aws_eip.main[0] will be updated in-place
  ~ resource "aws_eip" "main" {
        id                       = "eipalloc-0e6019904238ac9dc"
      ~ tags                     = {
          - "Environment" = "production" -> null
            "Name"        = "main-nat-eip-1"
        }
      ~ tags_all                 = {
          ~ "Environment" = "production" -> "dev"
            # (3 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # aws_eip.main[1] will be updated in-place
  ~ resource "aws_eip" "main" {
        id                       = "eipalloc-08d9616b1a683fc4d"
      ~ tags                     = {
          - "Environment" = "production" -> null
            "Name"        = "main-nat-eip-2"
        }
      ~ tags_all                 = {
          ~ "Environment" = "production" -> "dev"
            # (3 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # aws_internet_gateway.main will be updated in-place
  ~ resource "aws_internet_gateway" "main" {
        id       = "igw-04b3e897875405ab2"
      ~ tags     = {
          - "Environment" = "production" -> null
            "Name"        = "main-internet-gateway"
        }
      ~ tags_all = {
          ~ "Environment" = "production" -> "dev"
            # (3 unchanged elements hidden)
        }
      ~ vpc_id   = "vpc-02af4fc840205c9d0" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_launch_template.app will be updated in-place
  ~ resource "aws_launch_template" "app" {
        id                                   = "lt-021015f096ffea2d2"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "app-launch-template-20260306070640210200000004"
      ~ tags                                 = {
          - "Environment" = "production" -> null
        }
      ~ tags_all                             = {
          ~ "Environment" = "production" -> "dev"
            # (2 unchanged elements hidden)
        }
      ~ vpc_security_group_ids               = [
          - "sg-0891f84ab823c4c32",
          - "sg-0ca2e5e0be1dcd8f5",
        ] -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lb.app_lb must be replaced
-/+ resource "aws_lb" "app_lb" {
      ~ arn                                                          = "arn:aws:elasticloadbalancing:us-east-1:352953744040:loadbalancer/app/app-load-balancer-production/f820bceac352ef94" -> (known after apply)
      ~ arn_suffix                                                   = "app/app-load-balancer-production/f820bceac352ef94" -> (known after apply)
      ~ dns_name                                                     = "app-load-balancer-production-352139383.us-east-1.elb.amazonaws.com" -> (known after apply)
      - enable_cross_zone_load_balancing                             = true -> null
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      ~ id                                                           = "arn:aws:elasticloadbalancing:us-east-1:352953744040:loadbalancer/app/app-load-balancer-production/f820bceac352ef94" -> (known after apply)
      ~ ip_address_type                                              = "ipv4" -> (known after apply)
      ~ name                                                         = "app-load-balancer-production" -> "app-load-balancer-dev" # forces replacement
      + name_prefix                                                  = (known after apply)
      ~ security_groups                                              = [
          - "sg-00744813e72d3b312",
        ] -> (known after apply)
      ~ subnets                                                      = [
          - "subnet-0d9b7e87dac288e79",
          - "subnet-0dc800a425b9a0937",
        ] -> (known after apply)
      ~ tags                                                         = {
          - "Environment" = "production" -> null
          ~ "Name"        = "app-load-balancer-production" -> "app-load-balancer-dev"
        }
      ~ tags_all                                                     = {
          ~ "Environment" = "production" -> "dev"
          ~ "Name"        = "app-load-balancer-production" -> "app-load-balancer-dev"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                                                       = "vpc-02af4fc840205c9d0" -> (known after apply)
      ~ zone_id                                                      = "Z35SXDOTRQ7X7K" -> (known after apply)
        # (15 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - connection_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      ~ subnet_mapping (known after apply)
      - subnet_mapping {
          - subnet_id            = "subnet-0d9b7e87dac288e79" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-0dc800a425b9a0937" -> null
            # (4 unchanged attributes hidden)
        }
    }

  # aws_lb_listener.http_listener must be replaced
-/+ resource "aws_lb_listener" "http_listener" {
      ~ arn                                                                   = "arn:aws:elasticloadbalancing:us-east-1:352953744040:listener/app/app-load-balancer-production/f820bceac352ef94/9bb3836d52504d86" -> (known after apply)
      ~ id                                                                    = "arn:aws:elasticloadbalancing:us-east-1:352953744040:listener/app/app-load-balancer-production/f820bceac352ef94/9bb3836d52504d86" -> (known after apply)
      ~ load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:us-east-1:352953744040:loadbalancer/app/app-load-balancer-production/f820bceac352ef94" -> (known after apply) # forces replacement
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      ~ routing_http_response_server_enabled                                  = true -> (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      - tags                                                                  = {
          - "Environment" = "production"
        } -> null
      ~ tags_all                                                              = {
          ~ "Environment" = "production" -> "dev"
            # (2 unchanged elements hidden)
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:352953744040:targetgroup/app-target-group-production/1e785042cf4d6888" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ mutual_authentication (known after apply)
    }

  # aws_lb_target_group.app_tg must be replaced
-/+ resource "aws_lb_target_group" "app_tg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:352953744040:targetgroup/app-target-group-production/1e785042cf4d6888" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/app-target-group-production/1e785042cf4d6888" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:352953744040:targetgroup/app-target-group-production/1e785042cf4d6888" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:us-east-1:352953744040:loadbalancer/app/app-load-balancer-production/f820bceac352ef94",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "app-target-group-production" -> "app-target-group-dev" # forces replacement
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      ~ tags                               = {
          - "Environment" = "production" -> null
            "Name"        = "app-target-group"
        }
      ~ tags_all                           = {
          ~ "Environment" = "production" -> "dev"
            # (3 unchanged elements hidden)
        }
      ~ vpc_id                             = "vpc-02af4fc840205c9d0" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}
    }

  # aws_nat_gateway.main[0] must be replaced
-/+ resource "aws_nat_gateway" "main" {
      ~ association_id                     = "eipassoc-0e098702b0d494e25" -> (known after apply)
      ~ id                                 = "nat-01b6f56806e79145d" -> (known after apply)
      ~ network_interface_id               = "eni-03a96504ecff20d9c" -> (known after apply)
      ~ private_ip                         = "10.2.1.165" -> (known after apply)
      ~ public_ip                          = "3.217.244.252" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0dc800a425b9a0937" -> (known after apply) # forces replacement
      ~ tags                               = {
          - "Environment" = "production" -> null
            "Name"        = "main-nat-gateway-1"
        }
      ~ tags_all                           = {
          ~ "Environment" = "production" -> "dev"
            # (3 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_nat_gateway.main[1] must be replaced
-/+ resource "aws_nat_gateway" "main" {
      ~ association_id                     = "eipassoc-01107d7c87290a2f1" -> (known after apply)
      ~ id                                 = "nat-0341e033a2e16e037" -> (known after apply)
      ~ network_interface_id               = "eni-0d8e534173f4772e7" -> (known after apply)
      ~ private_ip                         = "10.2.2.22" -> (known after apply)
      ~ public_ip                          = "34.225.99.219" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0d9b7e87dac288e79" -> (known after apply) # forces replacement
      ~ tags                               = {
          - "Environment" = "production" -> null
            "Name"        = "main-nat-gateway-2"
        }
      ~ tags_all                           = {
          ~ "Environment" = "production" -> "dev"
            # (3 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_route.private[0] must be replaced
-/+ resource "aws_route" "private" {
      ~ id                          = "r-rtb-0e08b70ff89588dee1080289494" -> (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      ~ nat_gateway_id              = "nat-01b6f56806e79145d" -> (known after apply)
      + network_interface_id        = (known after apply)
      ~ origin                      = "CreateRoute" -> (known after apply)
      ~ route_table_id              = "rtb-0e08b70ff89588dee" -> (known after apply) # forces replacement
      ~ state                       = "active" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_route.private[1] must be replaced
-/+ resource "aws_route" "private" {
      ~ id                          = "r-rtb-07a1a50b44a5f3e741080289494" -> (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      ~ nat_gateway_id              = "nat-0341e033a2e16e037" -> (known after apply)
      + network_interface_id        = (known after apply)
      ~ origin                      = "CreateRoute" -> (known after apply)
      ~ route_table_id              = "rtb-07a1a50b44a5f3e74" -> (known after apply) # forces replacement
      ~ state                       = "active" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_route.public must be replaced
-/+ resource "aws_route" "public" {
      ~ id                          = "r-rtb-07199dbc2b33f3d2d1080289494" -> (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      ~ origin                      = "CreateRoute" -> (known after apply)
      ~ route_table_id              = "rtb-07199dbc2b33f3d2d" -> (known after apply) # forces replacement
      ~ state                       = "active" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_route_table.private[0] must be replaced
-/+ resource "aws_route_table" "private" {
      ~ arn              = "arn:aws:ec2:us-east-1:352953744040:route-table/rtb-0e08b70ff89588dee" -> (known after apply)
      ~ id               = "rtb-0e08b70ff89588dee" -> (known after apply)
      ~ owner_id         = "352953744040" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - nat_gateway_id             = "nat-01b6f56806e79145d"
                # (11 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ tags             = {
          - "Environment" = "production" -> null
            "Name"        = "private-route-table-1"
        }
      ~ tags_all         = {
          ~ "Environment" = "production" -> "dev"
            # (3 unchanged elements hidden)
        }
      ~ vpc_id           = "vpc-02af4fc840205c9d0" -> (known after apply) # forces replacement
    }

  # aws_route_table.private[1] must be replaced
-/+ resource "aws_route_table" "private" {
      ~ arn              = "arn:aws:ec2:us-east-1:352953744040:route-table/rtb-07a1a50b44a5f3e74" -> (known after apply)
      ~ id               = "rtb-07a1a50b44a5f3e74" -> (known after apply)
      ~ owner_id         = "352953744040" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - nat_gateway_id             = "nat-0341e033a2e16e037"
                # (11 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ tags             = {
          - "Environment" = "production" -> null
            "Name"        = "private-route-table-2"
        }
      ~ tags_all         = {
          ~ "Environment" = "production" -> "dev"
            # (3 unchanged elements hidden)
        }
      ~ vpc_id           = "vpc-02af4fc840205c9d0" -> (known after apply) # forces replacement
    }

  # aws_route_table.public must be replaced
-/+ resource "aws_route_table" "public" {
      ~ arn              = "arn:aws:ec2:us-east-1:352953744040:route-table/rtb-07199dbc2b33f3d2d" -> (known after apply)
      ~ id               = "rtb-07199dbc2b33f3d2d" -> (known after apply)
      ~ owner_id         = "352953744040" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - gateway_id                 = "igw-04b3e897875405ab2"
                # (11 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ tags             = {
          - "Environment" = "production" -> null
          ~ "Name"        = "public-route-table-production" -> "public-route-table-dev"
        }
      ~ tags_all         = {
          ~ "Environment" = "production" -> "dev"
          ~ "Name"        = "public-route-table-production" -> "public-route-table-dev"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id           = "vpc-02af4fc840205c9d0" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-047888800c91355aa" -> (known after apply)
      ~ route_table_id = "rtb-0e08b70ff89588dee" -> (known after apply)
      ~ subnet_id      = "subnet-0278720e0b51721a2" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-080d5766fc57d86dd" -> (known after apply)
      ~ route_table_id = "rtb-07a1a50b44a5f3e74" -> (known after apply)
      ~ subnet_id      = "subnet-04ebb91aa3b959bd6" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0023aadb0c25ee615" -> (known after apply)
      ~ route_table_id = "rtb-07199dbc2b33f3d2d" -> (known after apply)
      ~ subnet_id      = "subnet-0dc800a425b9a0937" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-01883cd93f9b4dd76" -> (known after apply)
      ~ route_table_id = "rtb-07199dbc2b33f3d2d" -> (known after apply)
      ~ subnet_id      = "subnet-0d9b7e87dac288e79" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.alb_sg must be replaced
-/+ resource "aws_security_group" "alb_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:352953744040:security-group/sg-00744813e72d3b312" -> (known after apply)
      ~ id                     = "sg-00744813e72d3b312" -> (known after apply)
      ~ name                   = "alb-security-group-production" -> "alb-security-group-dev" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "352953744040" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "production" -> null
          ~ "Name"        = "alb-security-group-production" -> "alb-security-group-dev"
        }
      ~ tags_all               = {
          ~ "Environment" = "production" -> "dev"
          ~ "Name"        = "alb-security-group-production" -> "alb-security-group-dev"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                 = "vpc-02af4fc840205c9d0" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.allow_ssh must be replaced
-/+ resource "aws_security_group" "allow_ssh" {
      ~ arn                    = "arn:aws:ec2:us-east-1:352953744040:security-group/sg-0891f84ab823c4c32" -> (known after apply)
      ~ id                     = "sg-0891f84ab823c4c32" -> (known after apply)
      ~ name                   = "allow-ssh-production" -> "allow-ssh-dev" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "352953744040" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "production" -> null
          ~ "Name"        = "ssh-security-group-production" -> "ssh-security-group-dev"
        }
      ~ tags_all               = {
          ~ "Environment" = "production" -> "dev"
          ~ "Name"        = "ssh-security-group-production" -> "ssh-security-group-dev"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                 = "vpc-02af4fc840205c9d0" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.app_sg must be replaced
-/+ resource "aws_security_group" "app_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:352953744040:security-group/sg-0ca2e5e0be1dcd8f5" -> (known after apply)
      ~ id                     = "sg-0ca2e5e0be1dcd8f5" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "HTTP from ALB only"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-00744813e72d3b312",
                ]
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = []
              - description      = "HTTPS from ALB only"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-00744813e72d3b312",
                ]
              - self             = false
              - to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTP from ALB only"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTPS from ALB only"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
        ]
      ~ name                   = "app-security-group-production" -> "app-security-group-dev" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "352953744040" -> (known after apply)
      ~ tags                   = {
          - "Environment" = "production" -> null
          ~ "Name"        = "app-security-group-production" -> "app-security-group-dev"
        }
      ~ tags_all               = {
          ~ "Environment" = "production" -> "dev"
          ~ "Name"        = "app-security-group-production" -> "app-security-group-dev"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                 = "vpc-02af4fc840205c9d0" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:352953744040:subnet/subnet-0278720e0b51721a2" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.2.11.0/24" -> "10.0.11.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0278720e0b51721a2" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "352953744040" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          - "Environment" = "production" -> null
          ~ "Name"        = "private-subnet-production-1" -> "private-subnet-dev-1"
        }
      ~ tags_all                                       = {
          ~ "Environment" = "production" -> "dev"
          ~ "Name"        = "private-subnet-production-1" -> "private-subnet-dev-1"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                                         = "vpc-02af4fc840205c9d0" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:352953744040:subnet/subnet-04ebb91aa3b959bd6" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.2.12.0/24" -> "10.0.12.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-04ebb91aa3b959bd6" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "352953744040" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          - "Environment" = "production" -> null
          ~ "Name"        = "private-subnet-production-2" -> "private-subnet-dev-2"
        }
      ~ tags_all                                       = {
          ~ "Environment" = "production" -> "dev"
          ~ "Name"        = "private-subnet-production-2" -> "private-subnet-dev-2"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                                         = "vpc-02af4fc840205c9d0" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:352953744040:subnet/subnet-0dc800a425b9a0937" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.2.1.0/24" -> "10.0.1.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0dc800a425b9a0937" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "352953744040" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          - "Environment" = "production" -> null
          ~ "Name"        = "public-subnet-production-1" -> "public-subnet-dev-1"
        }
      ~ tags_all                                       = {
          ~ "Environment" = "production" -> "dev"
          ~ "Name"        = "public-subnet-production-1" -> "public-subnet-dev-1"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                                         = "vpc-02af4fc840205c9d0" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:352953744040:subnet/subnet-0d9b7e87dac288e79" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.2.2.0/24" -> "10.0.2.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0d9b7e87dac288e79" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "352953744040" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          - "Environment" = "production" -> null
          ~ "Name"        = "public-subnet-production-2" -> "public-subnet-dev-2"
        }
      ~ tags_all                                       = {
          ~ "Environment" = "production" -> "dev"
          ~ "Name"        = "public-subnet-production-2" -> "public-subnet-dev-2"
            # (2 unchanged elements hidden)
        }
      ~ vpc_id                                         = "vpc-02af4fc840205c9d0" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_vpc.main must be replaced
-/+ resource "aws_vpc" "main" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:352953744040:vpc/vpc-02af4fc840205c9d0" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.2.0.0/16" -> "10.0.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-067251f89815adb99" -> (known after apply)
      ~ default_route_table_id               = "rtb-0d56331e68db9b3f4" -> (known after apply)
      ~ default_security_group_id            = "sg-0e9a6f63a51fd6ec9" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-05eef8ff44872eaed" -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-02af4fc840205c9d0" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-0d56331e68db9b3f4" -> (known after apply)
      ~ owner_id                             = "352953744040" -> (known after apply)
      ~ tags                                 = {
          - "Environment" = "production" -> null
          ~ "Name"        = "main-vpc-production" -> "main-vpc-dev"
        }
      ~ tags_all                             = {
          ~ "Environment" = "production" -> "dev"
          ~ "Name"        = "main-vpc-production" -> "main-vpc-dev"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

Plan: 29 to add, 4 to change, 29 to destroy.

Changes to Outputs:
  ~ autoscaling_group_name = "app-asg-production" -> "app-asg-dev"
  ~ load_balancer_arn      = "arn:aws:elasticloadbalancing:us-east-1:352953744040:loadbalancer/app/app-load-balancer-production/f820bceac352ef94" -> (known after apply)
  ~ load_balancer_dns      = "app-load-balancer-production-352139383.us-east-1.elb.amazonaws.com" -> (known after apply)
  ~ private_subnet_ids     = [
      ~ "subnet-0278720e0b51721a2" -> (known after apply),
      ~ "subnet-04ebb91aa3b959bd6" -> (known after apply),
    ]
  ~ public_subnet_ids      = [
      ~ "subnet-0dc800a425b9a0937" -> (known after apply),
      ~ "subnet-0d9b7e87dac288e79" -> (known after apply),
    ]
  ~ vpc_id                 = "vpc-02af4fc840205c9d0" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @lahiruUD, Action: `pull_request`*